### Part A: Data Preprocessing

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data=pd.read_csv("customer_raw_data_1500.csv")

In [3]:
data.head()

,Customer_ID,Age,Gender,City,Income,Customer_Since,Spending_Score
0,CUST1000,68,Unknown,new york,"$93,792",2022-02-16,79.0
1,CUST1001,43,MALE,Los Angeles,"$138,681",23/09/2022,74.0
2,CUST1002,73,MALE,Huston,"$30,858",30/07/2022,32.0
3,CUST1003,25,FEMALE,new york,"$138,103",2022-05-02,36.0
4,CUST1004,72,FeMale,Unknown,"$103,229",2022-08-30,83.0

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Customer_ID     1500 non-null   object
 1   Age             1500 non-null   int64
 2   Gender          1500 non-null   object
 3   City            1500 non-null   object
 4   Income          1370 non-null   object
 5   Customer_Since  1500 non-null   object
 6   Spending_Score  1482 non-null   float64
dtypes: float64(1), int64(1), object(5)
memory usage: 82.2+ KB

In [5]:
data.describe()

               Age  Spending_Score
count  1500.000000     1482.000000
mean     53.431333       49.843455
std      25.251846       29.282919
min      -5.000000        1.000000
25%      34.000000       24.000000
50%      53.000000       48.000000
75%      72.000000       76.000000
max     150.000000      100.000000

In [6]:
data.isnull().sum()

Customer_ID         0
Age                 0
Gender              0
City                0
Income            130
Customer_Since      0
Spending_Score     18
dtype: int64

In [7]:
data.shape

(1500, 7)

In [8]:
data.Gender.unique()

array(['Unknown', 'MALE', 'FEMALE', 'FeMale', 'female', 'Other', 'Male'],
      dtype=object)

In [9]:
data.isnull().sum()

Customer_ID         0
Age                 0
Gender              0
City                0
Income            130
Customer_Since      0
Spending_Score     18
dtype: int64

#### Identify and handle missing values

In [10]:
data['Income'] = data['Income'].replace('[\$,]', '', regex=True)
data['Income'] = pd.to_numeric(data['Income'], errors='coerce')

In [11]:
data['Income'].fillna(data['Income'].median(), inplace=True)

In [12]:
data['Spending_Score'].fillna(data['Spending_Score'].median(), inplace=True)

In [13]:
data.head()

,Customer_ID,Age,Gender,City,Income,Customer_Since,Spending_Score
0,CUST1000,68,Unknown,new york,93792.0,2022-02-16,79.0
1,CUST1001,43,MALE,Los Angeles,138681.0,23/09/2022,74.0
2,CUST1002,73,MALE,Huston,30858.0,30/07/2022,32.0
3,CUST1003,25,FEMALE,new york,138103.0,2022-05-02,36.0
4,CUST1004,72,FeMale,Unknown,103229.0,2022-08-30,83.0

In [14]:
data.shape

(1500, 7)

In [15]:
data.isnull().sum()

Customer_ID       0
Age               0
Gender            0
City              0
Income            0
Customer_Since    0
Spending_Score    0
dtype: int64

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Customer_ID     1500 non-null   object
 1   Age             1500 non-null   int64
 2   Gender          1500 non-null   object
 3   City            1500 non-null   object
 4   Income          1500 non-null   float64
 5   Customer_Since  1500 non-null   object
 6   Spending_Score  1500 non-null   float64
dtypes: float64(2), int64(1), object(4)
memory usage: 82.2+ KB

#### Fix inconsistent data formats

In [29]:
data['Customer_Since'] = pd.to_datetime(data['Customer_Since'], dayfirst=True, errors='coerce')
print("Invalid dates:", data['Customer_Since'].isnull().sum())

Invalid dates: 0

In [30]:
data.shape

(1476, 7)

In [19]:
data.head()

,Customer_ID,Age,Gender,City,Income,Customer_Since,Spending_Score
0,CUST1000,68,Unknown,new york,93792.0,2022-02-16,79.0
1,CUST1001,43,MALE,Los Angeles,138681.0,2022-09-23,74.0
2,CUST1002,73,MALE,Huston,30858.0,2022-07-30,32.0
3,CUST1003,25,FEMALE,new york,138103.0,2022-05-02,36.0
4,CUST1004,72,FeMale,Unknown,103229.0,2022-08-30,83.0

#### Handle categorical data

In [20]:
data['Gender'] = data['Gender'].str.title()
data['City'] = data['City'].str.title()

gender_mode = data.loc[data['Gender'] != 'Unknown', 'Gender'].mode()[0]
data['Gender'] = data['Gender'].replace('Unknown', gender_mode)

city_mode = data.loc[data['City'] != 'Unknown', 'City'].mode()[0]
data['City'] = data['City'].replace('Unknown', city_mode)

In [21]:
data.Age.unique()

array([ 68,  43,  73,  25,  72,  83,  33,  38,  80,  81,  64,  82,  16,
        29,  79,  41,  65,  88,  27,  31,  84,  36,  22,  62,  60,  61,
        24,  42,  19,  -5,  56,  58,  20,  39,  51,  17,  77,  23,  37,
        74,  59,  66,  40,  57,  54,  69,  63,  34,  89,  18,  70,  50,
        21,  26,  78,  71,  53,  30,  55,  28,  67,  85,  46, 150,  32,
        47,  48,  87,  49,  86,  52,  35,  45,  75,  44,  76], dtype=int64)

In [22]:
data = data[data['Age'] != -5]

In [23]:
data.shape

(1476, 7)

####  Remove duplicates and obvious data error

In [24]:
duplicates = data.duplicated()
print(f"Duplicate entries: {duplicates.sum()}")

Duplicate entries: 0

In [25]:
data = data[~duplicates]
data = data[data['Income'] > 0]

In [26]:
data.head()

,Customer_ID,Age,Gender,City,Income,Customer_Since,Spending_Score
0,CUST1000,68,Female,New York,93792.0,2022-02-16,79.0
1,CUST1001,43,Male,Los Angeles,138681.0,2022-09-23,74.0
2,CUST1002,73,Male,Huston,30858.0,2022-07-30,32.0
3,CUST1003,25,Female,New York,138103.0,2022-05-02,36.0
4,CUST1004,72,Female,Los Angeles,103229.0,2022-08-30,83.0

In [27]:
data.shape

(1476, 7)

### Part B: Exploratory Data Analysis

#### Summarize the dataset

In [28]:
# Summary statistics for Age
print("Age Summary:")
print("Mean:", data['Age'].mean())
print("Median:", data['Age'].median())
print("Mode:", data['Age'].mode()[0])

# Summary statistics for Income
print("\nIncome Summary:")
print("Mean:", data['Income'].mean())
print("Median:", data['Income'].median())
print("Mode:", data['Income'].mode()[0])

Age Summary:
Mean: 54.38143631436314
Median: 53.0
Mode: 25

Income Summary:
Mean: 84988.47425474254
Median: 84013.0
Mode: 84013.0

In [31]:
# Customers by City
print("\nCustomer Distribution by City:")
print(data['City'].value_counts())

# Customers by Gender
print("\nCustomer Distribution by Gender:")
print(data['Gender'].value_counts())

Customer Distribution by City:
Los Angeles    639
New York       421
Huston         214
Houston        202
Name: City, dtype: int64

Customer Distribution by Gender:
Female    825
Male      427
Other     224
Name: Gender, dtype: int64

#### Saving the dataset to new file

In [32]:
data.to_excel("cleaned_customer_data.xlsx", index=False)